class Texts:
##########################################################################
################################## Buttons ###############################
##########################################################################
    reply_kb1 = 'Игры 🎮'
    reply_kb2 = 'Профиль 👨‍💻'
    reply_kb3 = 'FAQ 📖'
    reply_kb4 = 'Поддержка 🛎'
    reply_admin = "👩‍💻 Панель администратора"
    back = "🔙 В главное меню"
    back_to_adm_m = "🔙 Назад"
    back = "⬅ Вернуться"
    support_inl = "⚙️ Тех. Поддержка"


##########################################################################
################################## Messages ##############################
##########################################################################
    reg_user = "💎 Зарегистрирован новый пользователь {name}" # {name} - username пользователя 
    welcome = "Добро пожаловать 👋"
    admin_menu = "добро пожаловать в меню Администратора 👋"
    def open_profile(self, user_id, balance, user_name, referals, referals_sum, refer_lvl, balance_vivod, refer_link):
        msg = f"""🆔 Ваш ID: {user_id}
                🤖 Username: {user_name}
                
                💰 Ваш баланс: {balance} 🪙
                💸 Выведено: {balance_vivod}
                
                👥 Приглашено пользователей: {referals} 
                🍬 Доход с рефералов: {referals_sum} | Уровень: {refer_lvl} 
                🔗 Реферальная ссылка: {refer_link}"""
        return msg
    admin_settings = "⚙️ Меню настроек"
    admin_edit_faq = "✍ Введите новый текст для FAQ"   
    faq_success = "✅ FAQ Успешно измененно"
    admin_mail = "❗ Выберите тип рассылки" 
    mail_only_text = "💎 Просто текст"
    mail_with_photo = "🖼 Текст с картинкой"
    admin_text_send = "🖊️ Введите текст рассылки"
    admin_newsletter = "✍ Отправьте сообщение для рассылки"
    admin_photo_send = "🖼️ Отправьте фото для рассылки"
    no_support = "<b>⚙️ Владелец бота не оставил ссылку на Тех. Поддержку!</b>"
    yes_support = "<b>📩 Чтобы обратиться в Тех. Поддержку нажмите на кнопку снизу:</b>"